01 TEST.
    05  Field-1 PICTURE X(100).
    05  Group-1 REDEFINES Field-1.
        10 Field-2 PICTURE 9(4).
        10 Field-3 PICTURE X(96).
    05  Group-2 REDEFINES Field-1.
        10 Field-4 PICTURE 9(4).
        10 Field-5 PICTURE X(50).
        10 Field-6 PICTURE X(46).
